[
    {
        "text": "Phil Murphy \nGovernor\nTahesha Way \nLt. Governor\nJustin Zimmerman \nCommissioner",
        "page": 1
    },
    {
        "text": "Dear New Jersey Home Buyer, \nHomeownership is the fulfillment of the American \ndream. As with any major purchase, you should  \nunderstand the product before you buy it. \nHowever, unlike most other commodities, buying a \nresidence can be a process much more complicated \nthan comparing prices. That is why the New Jersey \nDepartment of Banking and Insurance (NJDOBI) \nhas prepared this guide to help you finance, shop \nfor and insure your dream home.\nPurchasing a home will most likely be among \nyour largest and most important investments. \nTherefore, it is very important that you understand \nas much as possible about the process of buying \na home to ensure minimal stress and anxiety. \nFrom the fundamental question of why you should \nconsider homeownership, to recording the deed \nand mortgage, this guide is designed to provide \nyou with information you may need to know to buy \nyour dream home.   \nIf you need more information about anything \ncontained in this publication, visit the Department’s \nweb site, www.dobi.nj.gov, or call or write to the \nDepartment. Contact information is located on the \nback cover of this guide.\nSincerely, \nJustin Zimmerman \nCommissioner\nDisclaimer \nThis booklet is \nfor information \npurposes only, \nand must not \nbe relied on as \na substitute for \nlegal advice. ",
        "page": 2
    },
    {
        "text": "Steps to Buying a Home\nFor most of us, the process of buying a home may seem\ncomplex and intimidating. Knowing where to start, what to\ndo and what to look out for may save buyers time and\nmoney when purchasing a home. Note: If you have never\nowned a home or have not owned a home for the past\nthree consecutive years, you are considered a first-time\nhome buyer in New Jersey.\nStep 1: Getting Started .......................................... 2-7\nWhy Buy a Home?\nWhy Not Buy?\nAssess Your Financial Situation\nReview Your Credit History\nWhat’s the Score?\nStep 2: Going Shopping ....................................... 8-15\nShopping for a Mortgage Loan\nChoosing a Real Estate Professional\nFinding Your Dream Home\nStep 3: Making an Offer ..................................... 16-18\nPut it in Writing\nStep 4: Getting Ready for Settlement ................. 19-23\nHome Inspection, Title Search and More\nFinancing Review\nStep 5: Insuring Your Home ................................24-34\nHome Insurance Basics\nWhat is Covered by a Homeowner’s Insurance Policy?\nCommon Exclusions\nTypes of Policies\nUnderwriting Guidelines\nBuying the Right Amount of Coverage\nStep 6: Sealing the Deal ..................................... 35-36\nSettlement Statement\nFinal Walk-Through\nClosing\nRecording the Deed and Mortgage\n1",
        "page": 3
    },
    {
        "text": "Purchasing a home will most likely be among\nyour largest and most important investments.\nHomeownership offers many benefits, but\ncomes with certain responsibilities. Ultimately,\nyou need to determine the pros and cons of\nowning a home to make the best decision for\nyou and your family.\nIn general, homeownership offers several\nadvantages over renting:\n• It can be a sound investment\nAs you make mortgage payments over time, you accumulate equity –\nthe term used to refer to your net financial interest in the property. It is\nthe difference between the amount still owed on the mortgage loan and\nthe fair market value of the property. In contrast, rent payments never\nearn equity.\n• Increasing value\nIn general, property increases in value over time. This process is known\nas appreciation. (Note: Real estate value can depend on a number of\nvariables, including the property’s age and location, and appreciation is\nnot guaranteed.) Any increased worth is equity you may be able to borrow\nagainst or take as profit upon the sale of the property.\n• Tax advantages\nAs a homeowner, you can deduct mortgage interest and property taxes\nfrom your federal income taxes. Consult a tax professional for details.\n• Offers generally fixed housing expenses\nUnlike rent, which can increase annually, most mortgage loans have fixed\nor capped monthly payments. This can provide the financial security that\ncomes from knowing what your maximum housing payments (with the\nexception of property taxes, homeowner’s association fees, etc.) will be\nfrom year to year.\n2\nStep 1: Getting Started\nWhy Buy a Home?\n",
        "page": 4
    },
    {
        "text": "3\nBefore you begin looking for a home you may need to ask yourself: “How\nmuch can I pay for a house and still have a life?” You do not have to figure this\nout on your own. Consider getting pre-loan counseling from a Department-\nlicensed nonprofit credit counselor or an approved high-cost home loan counselor\nregistered with the U.S. Department of Housing and Urban Development\n(HUD) (call 1-800-569-4287 or visit online at www.hud.gov).\nIn most cases, a potential homeowner will need to obtain a mortgage loan –\nan advance of funds from a lender to a borrower for the purchase of real\nestate. The mortgage itself is a legal document that sets forth the conditions of\nthe loan, the manner and duration of repayment, and which pledges the\nStep 1: Getting Started\nWhy Not Buy?\nA realistic personal assessment may reveal that homeownership is not right for\nyou or you might want to delay the process. Your personal and financial priorities\nwill determine what’s best for you.\nBe aware that buying a home:\n• Can be a complex, time-consuming and costly process.\n• May bring unwanted responsibilities such as maintenance and repairs\nand additional expenses – property taxes, utilities, homeowner’s insurance,\netc.\n• Can possibly create financial hardship.\n• May be difficult if your credit is not favorable to a lender.\nAssess Your Financial Situation\n• Gives you control over your environment\nHomeownership allows you the opportunity to customize your environment\nto match your individual tastes and needs. You can develop a feeling of\npermanence in a place that you can call your own. Of course, this also\nmeans that you are responsible for all utility costs and the cost of repairs\nand maintenance on the property. There is no landlord to maintain the\nproperty or take care of any problems.",
        "page": 5
    },
    {
        "text": "4\nStep 1: Getting Started\nborrower’s property (home) as security for the loan. The mortgage principal,\nthe amount of the loan required to buy your home, and interest, the fee charged\nfor borrowing the money, will typically be large enough to require mortgage\npayments for a significant period of time – often 15 to 30 years.\nDebt to Income Ratio (DTI) – One of the first factors\na lender may consider when deciding how large a\nmortgage loan you qualify for is your debt to income\nratio, or DTI. To calculate your DTI, add up your\ncurrent monthly debt (credit card payments, car loans,\netc.) and divide it by your total monthly pre-tax gross\nincome. This percentage ratio is a simple way of\nshowing how much of your income is available to make\na mortgage loan payment after all other continuing debt\nobligations are met.\nLenders often call this the 28/36 qualifying ratio. The first number, 28 percent,\nindicates the maximum amount of your monthly pre-tax gross income that the\nlender allows for monthly housing expenses. This amount will include principal\nand interest of the loan, property taxes, and homeowner’s insurance, or\nPITI. The second number, 36 percent, refers to the maximum percentage of\nyour monthly pre-tax gross income that the lender allows for all monthly housing\nexpenses plus all recurring debt.\nIf your ratio numbers are higher than 28/36, you may want to consider reducing\ndebt by paying off credit cards or other loans before starting your home search.\nWhen calculating and relying on your DTI to determine loan affordability, be\nconfident with your numbers and do not be afraid to stick with them as you\nshop around. Some lenders may allow higher ratios and be willing to loan you\namounts that will take you beyond the traditional qualifying ratio and what you\nYou will be living with mortgage loan payments for a large portion\nof your life.  To accurately predict your monthly payment and to\neliminate surprises later in the process, you will need to learn about\nsome additional commonly used mortgage terms:\nCommonly Used Mortgage Terms",
        "page": 6
    },
    {
        "text": "5\nStep 1: Getting Started\ncan afford. This could lead to more costly monthly payments and might cause\nfinancial hardship if you find that your loan is not affordable once  you have\nmoved into your new home.\nDown Payment – The down payment  is part of the purchase price of a\nproperty that the buyer pays, usually in cash, and is not included in the loan\namount. Most lenders require five to 20 percent of the purchase price of the\nhome, depending on the type of mortgage loan.\nReview your budget and make a decision about how much of a down payment\nyou can reasonably afford to pay. If you do not have enough, you may be able\nto qualify for a loan under various government programs that are available.\nPrivate Mortgage Insurance (PMI) – Any down payment less than 20 percent\ngenerally will require Private Mortgage Insurance (PMI), which protects the\nlender against loss if a borrower defaults on a loan. While it does not protect the\nborrower, it may allow the borrower to qualify for a loan they could not otherwise\nget. The premium (the amount of money charged for insurance) is paid up\nfront or financed as part of the mortgage.\nPMI usually can be cancelled when the homeowner builds up enough equity in\nthe home. Under federal law, PMI on most loans made on or after July 29,\n1999, will end automatically once the mortgage is paid down to 78 percent of\nthe original value of the house.\nInterest Rate  – As you know, the interest rate is the cost of borrowing money.\nMortgage loans have repayment terms in the general form of a fixed rate ,\nwhere the monthly interest payment does not change over time. This is often\ncalled a “conventional mortgage.” Another common type of mortgage loan\nis the variable or adjustable rate mortgage (ARM). An ARM has an interest\nrate that changes periodically during the loan’s life.\nConventional loans are generally thought of as more stable as they are not\nsubject to fluctuating interest rates that can make dramatic swings over a long\nperiod of time. This accounts for the popularity of fixed rates, which often\nattract borrowers who plan to stay in one place for a considerable amount of\ntime. The length of these loans most frequently selected is the 30-year mortgage,\nbut 15-year and 40-year have grown in popularity.",
        "page": 7
    },
    {
        "text": "Step 1: Getting Started\n6\nYour current debt is not the only factor used in the lending process. Your credit\nhistory will also impact the interest rate and terms of your loan, the minimum\namount of your down payment, or even if you will receive a loan at all. Get a\ncopy of your credit report from one or all three major credit reporting agencies\n(Equifax, Experian and TransUnion ). New Jersey and federal law entitles\nresidents to one free report from each agency per year.\nA credit report gives potential creditors a “snap shot” of your credit worthiness.\nIt will show what types of credit you currently have and/or what you have had\nin the past. It also shows if you have paid your bills on time, filed for bankruptcy,\nor if you have ever been evicted from a rental property.\nIt is important to make repairs to your credit\nhistory before you apply for a mortgage loan.\nCheck your credit report(s) for any\ndiscrepancies that may have a negative impact\non your ability to secure financing. If you\nfind any errors, contact the reporting agency\nimmediately and request a correction.\nReview Your Credit History\nAlso more popular is the ARM, which will lock the borrower into a lower fixed-\nrate for a specific period of time, often five years, and then will rise according\nto terms agreed to in the loan. An ARM and another type of loan more popular\ntoday, interest-only mortgages , make owning a home more affordable early\nin the ownership period and drive up costs later. These types of mortgages may\nwork well for first-time home buyers who are reasonably confident of an income\nincrease that will compensate for the rise in loan payments. It also attracts\nthose who expect to sell a home before the fixed-rate portion of the ARM ends.\nYour lender will give you the option to “ lock in” a rate quote for a specific\nperiod of time, often 60 days. A rate lock fixes the rate against a rise in rates,\nbut rates may also fall in the time between the quote and your closing date.\nWhen filing your mortgage application, make sure you review your loan terms\ncarefully to make certain you understand the rates and fees charged. Should\nyou decide to lock in a rate, be certain to allow enough time so that you close\nbefore your lock-in expires.\n",
        "page": 8
    },
    {
        "text": "7\nStep 1: Getting Started\nYou can establish good credit by:\n• Having a steady source of income; this usually means working consistently\nfor two to three years.\n• Having a good record of paying your bills on time.\n• Keeping outstanding long-term debts low.\n• Putting money in a savings account.\nIf your credit is not in good shape, you may want to wait to purchase a home\nand spend the time needed to repair your credit instead. You may wish to consult\na certified credit counselor who can help you get back on track.\nAccess all three reports:\nwww.annualcreditreport.com; 1-877-322-8228\nOr contact the three major credit reporting agencies :\nEquifax: www.equifax.com; 1-800-685-1111\nExperian: www.e xperian.com; 1-888-397-3742\nTransUnion: www.transunion.com; 1-800-888-4213\nWhat’s the Score?\nYour credit score or FICO (for Fair, Isaac and Company, which created the\nsystem) is a number that indicates the health of your credit. The higher the\nscore, the healthier your credit and the more likely a lender will approve a loan\nwith good terms.\nScores can range from 300 to over 800, with the typical credit score falling\nbetween 600 and 700. You can receive your credit score from the credit reporting\nagencies for a reasonable fee.\nThe best loan terms go to individuals with the best credit history.\nA poor credit rating will likely mean a more expensive loan. The\ndifference between having “just okay” credit and good credit can\ncost you tens of thousands of dollars over the life of a loan.\nGet Your Free Credit Report",
        "page": 9
    },
    {
        "text": "8\nShopping for a Mortgage Loan\nAs with any major purchase, it pays to shop around when looking for a mortgage\nloan. Different lenders will offer different terms, have different requirements,\nand offer varying levels of service.\nPre-Qualify or Pre-Approval for a Mortgage\nFollowing a personal assessment of your financial situation, you need to find\nout how much house you can afford.\nTo help determine the amount you may be eligible to borrow for a mortgage\nloan, consider getting pre-qualified with a mortgage lender. This free service\ngenerally takes about two days and involves providing income, asset and debt\ninformation to a lender who may issue a letter to the home shopper.\nTaking this process a step further, a potential home buyer may get pre-approved\nfor a mortgage. This means getting a guaranteed loan for a certain amount that\ngenerally lasts for 60 to 90 days from the date issued. A pre-approved loan may\ninvolve a nonrefundable fee, but\nis often considered an advantage\nfor a buyer because it speeds up\nthe closing process.\nBe sure to ask the lender about\nthe types of loans available to you\nand if there are any qualifying\nguidelines; what is the minimum\ndown payment; and what would\nbe included in the monthly\nmortgage payment – typically, the\nprincipal  and interest  of the\nloan, property taxes , and\nhomeowner’s insurance , or\nPITI. Your payment may also\ninclude Private Mortgage\nInsurance and any homeowner’s\nassociation dues, if applicable.\nStep 2: Going Shopping\nWhen shopping for a mortgage\nloan, don’t be afraid to ask basic\nquestions, with the most basic\nbeing the official name of the\nlender. Find out the true identity\nof the lender. Are they a licensed\nlender, financial institution, or\nsimply a servicing company? Is\nthe company licensed by the state\nof New Jersey? Ask for the\ncompany’s license number and\nconfirm it with the Department of\nBanking and Insurance online at\nwww.dobi.nj.gov.\nKnow Your Lender",
        "page": 10
    },
    {
        "text": "9\nStep 2: Going Shopping\nSome factors to consider when shopping for a mortgage loan…\nLoan first, house second\nFind out how much house you can afford before you fall in love with a\nhouse that you will struggle to purchase and maintain.\nConsider getting pre-qualified or pre-approved\nA written commitment from a lender puts a potential home buyer in a better\nposition.\nKnow the application costs\nThere may be a fee required to apply for a mortgage.\nThis fee might be charged when you apply, when\nthe loan is approved, or at closing. Be sure you know\nhow much this fee is and when it will be charged.\nLook for a reputable lender\nRemember, a lender makes a commission from closing or “selling” the loan,\nnot from looking out for your best interest. Consider the lender’s stability\nand service record.\nUnderstand the interest rate\nRemember to ask if the loan has a fixed or adjustable rate of interest . A\nfixed-rate mortgage charges a set rate of interest that does not change over\nthe life of the loan. An adjustable rate mortgage varies over time. This could\nmake a big difference in what your monthly payments will be.\nConsider getting the interest rate locked in\nRates quoted prior to closing are subject to change unless they are locked\nin. Locking in your interest rate on an application is often preferable to\nwaiting until the loan is approved.\nCollect all the financial papers you will need to\ncomplete a mortgage loan application. This can include\nyour job history, income records, a list of your assets\n(investments, property, bank accounts) and liabilities\n(auto loans, installment loans, other mortgages, credit\ncard debt).\nBe Prepared",
        "page": 11
    },
    {
        "text": "10\nKnow the Law\nThe New Jersey Homeowners Security Act of 2002 (NJHOSA) , with\namendments in 2004, applies to all home loans secured by New Jersey realty or\nmanufactured homes. This law is designed to protect consumers when buying\na home, and includes several provisions of which you should be aware.\nThe Homeowners Security Act explicitly prohibits lenders from:\n• Financing certain credit insurance premiums or debt cancellation\nagreements;\n• Recommending or encouraging default on an existing mortgage loan;\n• Charging a late payment fee in excess of 5 percent of the amount of the\npayment due;\n• Accelerating indebtedness at the creditor’s sole discretion; and\n• Charging a fee for a borrower’s payoff balance information.\nAdditional protections apply to high-cost loans . High-cost loans are more\nthan 8 percent higher than the federal index or exceed 4.5 percent of the total\nloan amount in points and fees.\nFor high-cost loans, lenders are prohibited from (among other provisions):\n• Charging most “balloon payments” (see below);\n• Negative amortization (when the principal balance of the loan increases\neven though all payments are being made);\n• Increasing the interest rate after default; and\n• Requiring more than two periodic payments to be paid in advance.\nFor more information, visit www.dobi.nj.gov.\nStep 2: Going Shopping\nA mortgage with periodic installments of principal and\ninterest that do not fully amortize (repay over time)\nthe loan and then has a lump sum payment required\nat a certain date, often near the end of the term, is\nfrequently called a balloon mortgage . Watch out\nfor hidden lump sum payments. Make sure that you\nread the full terms of your loan agreement.\nBeware of\nBalloon\nMortgage\nPayments",
        "page": 12
    },
    {
        "text": "Predatory Lending\nPredatory lending can mean any type of abusive\nlending practice where the lender benefits\nthrough unworthiness, deceit, misrepresentation,\nbad faith, or dishonesty. These practices can\noccur in the subprime lending market  and often target lower-income and\nminority borrowers. Subprime lending is not synonymous with predatory lending,\nhowever, and loans with subprime features are not necessarily predatory in\nnature. (For more information on subprime loans, see NJDOBI’ s “A\nHomeowner’ s Guide to Subprime Lending” brochure.)\nSome common forms of Predatory Lending:\nUnaffordable loans – Loans that are based on equity or  assets rather\nthan the borrower’s monthly income and ability to make payments.\nLoan flipping – Encouraging repeated refinancing – which requires\nadditional fees and points from the borrower each time – thus draining the\nborrower’s assets. You could become burdened with higher payments,\nlarger debt and ultimately face the possibility of losing your home.\nFraud or deception – Concealing the true nature of the loan obligation\nfrom the borrower.\nBait and switch – Verbal representations of favorable terms are made to\nsell a loan and different, less favorable terms are presented at the closing.\nPressure – Aggressive sales tactics are used to induce a borrower to sign\nan expensive, or unaffordable loan contract.\nStep 2: Going Shopping\n11\nAvoid being a victim of predatory lending by doing your homework and\nshopping around. Do not focus simply on interest rates, and learn all of the\nterms and conditions of the loan.  Do not sign anything you have not\nread or do not understand completely, and never sign a blank or\nincomplete document – you never know what may be filled in\nafter you have signed. Always work with a licensed lender, broker\nor depository institution, and do not give in to high-pressure sales\ntechniques. This is one of the biggest financial commitments you will\nmake in your life, so shop on your time, at your pace.\n(For more information about finalizing your mortgage, see page 21.)\nRead Carefully Before You Sign on the Dotted Line\n",
        "page": 13
    },
    {
        "text": "All the details involved in buying a\nhome can be confusing. Finding the\nright real estate professional for you\nis a great first step toward making\nthe experience much easier.\nIn New Jersey, there are four\nbrokerage business relationships:\nseller’s agent , buyer’s agent ,\ndisclosed dual agent  and transaction broker . Each of these relationships\nimposes certain legal duties and responsibilities on the licensee, as well as the\nseller or buyer represented.\nAll four of these types of agents must be licensed by the New Jersey Real\nEstate Commission (REC), a division of the New Jersey Department of Banking\nand Insurance. Agents are required to demonstrate, to the Real Estate\nCommission’s satisfaction, that they are honest, trustworthy and of good\ncharacter and integrity in order to obtain a license.\nAll licensed agents work under the authority of a real estate broker. One of\nthe best sources for finding an agent you can trust is through referrals. Ask\nsomeone you know who has recently purchased or sold property about their\nexperience.\nCompile a list of several agents and talk to each one before choosing. Look for\nan agent who listens well, understands your needs, and whose judgment you\ntrust. The ideal agent knows the local area well and has resources to help you\nin your search. Overall, you want to choose an agent that makes you feel\ncomfortable and can provide the knowledge and services you need.\nAll REC Licensees must:\n• Deal honestly with all parties.\n• Disclose any known physical condition of properties sold or leased that\naffects the property in a material way.\n• Faithfully administer escrow funds.\n12\nStep 2: Going Shopping\nChoosing a Real Estate Professional",
        "page": 14
    },
    {
        "text": "Choosing a Real Estate Professional\n13\nStep 2: Going Shopping\nIf you have any questions concerning the behavior of an agent or broker, you\nshould contact the New Jersey Real Estate Commission. The Real Estate\nCommission cannot recommend a broker or agent to represent you, but it can\nconfirm the status of a license. To check the status of a licensee, visit the\nCommission on the web at www.dobi.nj.gov.\nExclusive Buyer/Agency Contracts\nThe Exclusive Buyer/Agency Contract is an optional agreement that some\nbrokerage firms (agencies) choose to present to their clients. Once signed, this\ncontract is binding for both the agent and the buyer. The intent of these\nagreements is to make sure the buyer and his or her agent understand that the\nagent is working on behalf of the buyer, and the buyer will use the services of\nthat particular brokerage firm (agency) exclusively for a designated period of\ntime. If you are presented with this type of agreement, make sure your agent\nexplains the content in detail and you fully understand and agree to what you\nare signing.\n• Submit all written offers according to rules and regulations.\n• Disclose in the contract any personal interest the agent has in the\ntransaction.\n• Prior to discussing any real estate matters, disclose to all parties the agent’s\nbusiness relationship – seller’s agent, buyer’s agent, dual agent or\ntransaction broker.\n• Provide the Consumer Information Statement prescribed by the REC.\nWhen a real estate agent facilitates the sale or purchase of\nproperty their broker receives compensation through a\ncommission – generally a percentage of the sale price. Brokerage\nfirms (real estate agencies) that provide a full array of services\ncharge a commission based on that level of service. Some firms\nprovide fewer services and charge a commission rate based upon\nthat level of services. Consumers are always free to attempt to\nnegotiate a lower commission rate.\nCommission Rates",
        "page": 15
    },
    {
        "text": "Consider these factors as you narrow your search:\n• Quality and availability of schools and libraries;\n• Proximity to work, major highways and mass transportation;\n• Immediacy of shopping, religious\ncenters, hospitals and recreation\nfacilities/parks;\n• Property tax rates, income tax\nrates and other community\nexpenses as compared with\nsimilar homes in other\nneighborhoods (i.e., association\nfees, snow and trash removal,\ncommon ground maintenance);\n• Utility expenses, trash collection and sewage disposal (past utility expenses\nare available from the utility company);\n• Availability of public services such as police and fire protection;\n• Local zoning ordinances and condition of other properties in the\nneighborhood.\nNext, consider your priorities. If you can’t find a home within your price range\nwith all the features you want, then decide which features are most important\nto you. Would you prefer a large kitchen or an extra bathroom? Would you\ntrade a bigger yard for a shorter commute? Write out this list and share it with\nyour real estate professional. This will help your agent limit the search to only\nthose homes truly of interest to you.\n14\nStep 2: Going Shopping\nFinding Your Dream Home\nEveryone’s idea of a “dream home” may be different, so it is important to\nformulate a list of the features and benefits you would like in a home. Consider\nfactors such as pricing, location, size, amenities and design. It often pays to\nattend several open houses where sellers open up their homes to potential buyers.\nYou can see a variety of options to help you develop a list of your requirements.\nYour real estate professional will be able to provide guidance and help.",
        "page": 16
    },
    {
        "text": "What is Your Dream Home?Step 2: Going Shopping\nIf you look at more than a few homes, they can quickly become a blur. To help\nkeep track, refer to your list of priorities and make notes of which of your\ndesired features are in each house. It is easiest to do this on the listing sheets\nthat agents often provide for you, which can include a photo and certain\ninformation regarding the property. Afterwards, compile a worksheet based on\nyour priorities and give each house a rating.\nPay Attention to the Details\nOnce you have begun to narrow down specific properties, go beyond the surface\nappearance and look carefully at each house. Be sure to examine the physical\ndetails and construction. Particular details about a home may be available in a\nresidential property disclosure form , if the seller has completed one. This\nform is a questionnaire that gives you an overview of the physical history and\ncondition of the property according to the seller’s knowledge. The listing agent\npresents the form to the seller, who should complete it truthfully. It then becomes\na part of the file on that particular property. Ask your real estate professional\nfor a copy. As you progress through the home buying process you may also\nwant to consider having a home inspection conducted by a professional third\nparty (see page 19).\nNew Construction\nBuilding a new home  presents its own\nset of complications. First, you must find\na reputable builder who is involved in an\narea where you would like to live. Then\nyou must evaluate various lots within the\ndevelopment and select a floor plan\nwhich suits your needs. Frequently the\nbuilder will have its own financing\npackage, which you will want to compare\nagainst other mortgages from various\nlenders. If the home comes with a\nwarranty, be sure to read it carefully and\nnote what is covered and for how long.\nConsider having the home inspected by\na professional third party (see page 19).\nIt is very important to find out what is included with the basic home and what\nis considered an upgrade. Don’t assume that all you see in the builder’s model\nis standard. Most builders offer a wide range of options from doors and windows\nto flooring to countertops and fixtures.\n15\nFind a Builder\nIf you would like more\ninformation on new\nconstruction, visit the New\nJersey Department of\nCommunity Affairs  at\nwww.state.nj.us/dca/\n(where you can access a list\nof registered New Jersey\nhome builders and find\ninformation regarding the\nstate’s New Home Warranty\nProgram).",
        "page": 17
    },
    {
        "text": "16\nPut it in Writing\nOnce you have selected a house, you need to make an offer. At this point, you\nmay want to have a lawyer.\nLegal Counsel\nMany home buyers choose to be represented by an attorney during the home\nbuying process; however, it is not a requirement. Since real estate agents and\nbrokers cannot advise you on legal matters, an attorney will be your advocate\nin contract negotiations and any disputes that may arise before or at a real\nestate settlement.\nWhile retaining an attorney is an additional expense, attorney fees will be much\nhigher in the event of any legal action. An attorney you retain represents your\ninterests only and can provide valuable assistance and advice.\nShopping for an attorney is comparable to shopping for a real estate agent.\nLook for reliable recommendations. Choose an attorney who has experience\nwith real estate transactions, has represented home buyers before and is right\nfor you. Be sure to ask what services are performed and what they cost.\nOffer to Purchase\nYou, as the interested buyer, may work with your real estate agent to prepare a\npreliminary document called a “ purchase offer ” for the seller to consider.\n(Some agents will begin with a contract of sale – see page 17.) An offer to\npurchase is a written preliminary proposal that states what you are willing to\npay for the home, the estimated closing date and certain other terms that you\nmight want included in the contract that the buyer and seller need to agree\nStep 3: Making an Offer\nNote:\nAn attorney who acts as a general closing agent is usually\nretained by the lender or others involved in the transaction.\nThis attorney does not represent the buyer in any dispute\nwith the seller, lender or others involved in the transaction.\nOnly an attorney you retain represents your interests as\nthe buyer.  To locate an attorney in your area, contact the\nNew Jersey State Bar Association at 732-249-5000 to locate\nyour county bar association for a referral.",
        "page": 18
    },
    {
        "text": "upon. (An example of this might be the inclusion of any appliances or light\nfixtures.) Remember, the terms of the offer to purchase may become a part of\nthe actual contract of sale if your offer is accepted and a contract is signed.\nAlong with this offer you will typically include an earnest money deposit, a\nnominal amount to show that a buyer is serious about the purchase. This deposit\nwill become part of your down payment, the total amount of cash for the\nhome purchase that is not financed.  This deposit should be placed in an escrow\naccount – in this case, a monetary trust maintained by a third party (an escrow\nagent) to hold money safely while a sale is in progress.\nThe seller may accept your offer to purchase, reject it, or make a counter-\noffer. If a seller wants to change any part of the offer, you may receive a\ncounter-offer specifying those changes. You have the option to accept the\ncounter-offer or you may respond by presenting one of your own.\nThese counter-offers are sometimes verbally communicated between the agents\nand their clients, but should be memorialized in writing within 24 hours. Copies\nshould be provided to all interested parties. Typically, this document and its\ncontents are subject to the parties entering into a full contract and are not\nlegally binding. In such cases, it is only when the contents of the offer to\npurchase become a part of the terms and conditions of the contract of sale that\nthey become legally binding.\nIf, for some reason, you decide that you want to revoke your offer, you should\nimmediately notify your real estate agent and/or your attorney if you have one.\nContract of Sale\nA contract of sale is a legally binding document that sets forth the terms of the\nhome purchase. If you started the negotiating process with an offer to purchase,\nthe contract of sale will include the contents of the offer  to purchase, as finally\nagreed upon by the parties, plus any additional details and terms. If the contract\nof sale is prepared by a real estate licensee, it must contain a provision known\nas the “ attorney review clause ,” which provides that the buyer and seller\nhave three (3) business days from the date that the completely signed contracts\nare delivered, to consult with an attorney. During this three-day period, if you\nchoose to use an attorney, he or she may propose revisions to the contract on\nyour behalf or render it null and void.\n17\nStep 3: Making an Offer",
        "page": 19
    },
    {
        "text": "Deposits or Earnest Money\nAn earnest money deposit is made with the initial offer to purchase to show\nthat the buyer is serious about purchasing the property. During the settlement\nprocess, the deposit money is usually applied as a part of the down payment\ntowards the purchase price. Typically an additional deposit is made sometime\nwhile the contract is being executed. A scheduled date for this deposit is reflected\non the contract.\nAn escrow agent specified in the contract will hold the deposit money in an\nescrow account. If the offer is not accepted, you are usually entitled to a\nrefund of your deposit. If the transaction does not settle, there could be a\ndispute over who is entitled to the deposit. The matter could wind up in court\nfor resolution. The contract may contain terms for the return or forfeiture of\nany earnest money deposit. Therefore, you need to read and understand this\nsection of the contract carefully.\n18\nStep 3: Making an Offer\nYour contract should clearly set forth the following terms:\n• The total price you agree to pay;\n• The amount of down payment you will make;\n• Any and all escrowed deposits to date;\n• Anything in the house or attachments that you would like to be included,\nsuch as appliances, drapes, chandeliers, fireplace tools, etc.;\n• The amount of time after the offer is accepted you will have to arrange\nfinancing;\n• When the transaction will “close” or title will transfer;\n• When you will take possession of the property;\n• Provisions for title searches, and insect, structural and other inspections\n(see pages 19-21).\nNote:\nIf you choose to have an attorney prepare your contract of\nsale (this might be an additional expense), it may or may not\ninclude a three-day review period . Be sure to have your\nattorney explain your rights.",
        "page": 20
    },
    {
        "text": "19\nHome Inspection, Title Search and More\nIndependent Home Inspection\nIt is highly recommended that you have a qualified,\nindependent home inspector visit the property soon\nafter a contract becomes binding. An inspector will\nevaluate the physical condition of the structure,\nconstruction and mechanical systems of the home,\nand identify defaults or any items that should be\nrepaired or replaced.\nIt is a good idea to be present for the home inspection\nso the inspector can address any concerns or questions\nyou may have. You will receive an impartial written\nassessment report of the property.  If any defaults are\nrevealed by the inspection, you and the seller are limited to time periods stipulated \nin the contract as to how long you have to provide the report to the seller and \nhow long the seller has to decide if th ey will cure or correct any defau lts. For \nspecifics, consult your real estate agent and/or attorney. You can consult with \nyour real estate agent for a list of home inspectors. There is a fee fo r this \nservice.\nOther Details to Consider...\nLead paint – In houses built prior to 1978, the seller must disclose any\nknown lead-based paint and lead-based paint hazards. The seller must\nprovide the buyer with a lead-based paint disclosure form and any records\nor reports in their possession. For more information, visit HUD online at\nwww.hud.gov/offices/lead/.\nToxic mold – Contamination can lead to a variety of health and respiratory\nproblems. Make certain your independent home inspector checks attics\nand crawl spaces for leaks and moisture that could support mold. For\nmore information, visit the U.S. Environmental Protection Agency (EPA)\nonline at www.epa.gov/mold/.\nRadon – This is a colorless, odorless gas that, when trapped in buildings,\ncan be harmful at elevated levels. Ask your independent home inspector if\nradon is a problem in your area and if it will be part of the inspection. For\nmore information, visit the EPA online at  www.epa.gov/radon/.\nStep 4: Getting Ready for Settlement",
        "page": 21
    },
    {
        "text": "20\nAsbestos – Prior to the 1970s, asbestos was used in many different\ninsulation and fireproofing applications. You cannot tell whether a material\ncontains asbestos simply by looking at it unless it is labeled. If in doubt,\ntreat the material as if it contains asbestos, or have it sampled and analyzed\nby a qualified professional. For more information, visit the EPA online at\nwww.epa.gov/asbestos/.\nMegan’s Law – Under New Jersey law, the county prosecutor determines\nwhether and how to provide notice of the presence of convicted sex\noffenders in an area.\nOff-Site Conditions – The clerks of municipalities in New Jersey maintain\nlists of off-site conditions which may affect the value of residential properties\nin the vicinity. Examples of such conditions are proposed construction in\nthe area, or a nearby toxic waste contamination problem, etc.  Purchasers\nmay examine the lists and can independently investigate the area surrounding\nthe property to become familiar with any off-site condition which may\naffect the value of the property.\nStigmatized property – The residential property disclosure form  (see\npage 15) includes an overview of physical and material issues regarding a\nproperty. However, some home buyers are also interested in less tangible\nissues, or potential psychological factors of living in certain properties.\nStigmatized property is defined as property that is in some way tainted due\nto factors unrelated to its physical condition. Some examples of stigmatized\nproperty are a house that is alleged to be haunted, or the scene of a violent\ndeath. Legally, the seller and agent are not obligated to disclose these issues\nup front. But if asked, the seller and agent are obligated to disclose any\nsuch issues of which they have knowledge.\nTitle Search\nMost purchase agreements are conditioned upon a title search that guarantees\nthat there are no liens and/or judgments that affect the property, including whether\nthe seller is involved in a bankruptcy. This is done by professionals who examine\nrecords of ownership transfers and other liens and claims on properties. If\nsomeone else has a claim against the property, the seller’s title to it is not\n“clear.”  In this case, you are not obligated to finalize the purchase. Your real\nestate attorney can evaluate the title and advise accordingly. With the exception\nof privately financed purchases, in essentially all cases your lender will require\nStep 4: Getting Ready for Settlement",
        "page": 22
    },
    {
        "text": "21\nStep 4: Getting Ready for Settlement\nYou are expected to arrange the remaining steps of financing as soon as possible\nafter your offer has been accepted. If you have not been pre-approved (see\npage 8), mortgage loan processing can take from 30 to 90 days.\nMany homebuyers – especially first-time buyers – are sometimes shocked when\nthey see the total bill for their loan, and may not have a firm grasp on exactly\nwhat it is they are paying. These costs are to be expected, as they are part of\nthe home-purchasing process, but it is advantageous for prospective home\nbuyers to familiarize themselves with the most common terms and charges. If\nyou are in doubt about any charges assessed, do not hesitate to ask the lender.\nSome of the most common mortgage loan charges include:\nEscrow account – A monetary trust account set up by the lender to which\nthe borrower makes monthly payments toward future costs. For example,\nhomeowners often pay a monthly amount beyond the actual cost of their\nmonthly principal and interest payment, which is held by the company in\nyou to purchase title insurance, which protects you and the lender up to the\npurchase price of the property in the event that title to the property is found to\nbe invalid. This is a one-time fee paid at closing. (If you are privately financing\nthe purchase, you should consider purchasing title insurance to protect you\nfrom claims against prior owners.)\nPrior to closing, there are several other inspections and certifications that you,\nthe seller, and/or your agent’s office will order. Outside of the complete\nindependent home inspection  (see page 19 ) – and depending on what is\nnecessary for your particular property – the following may also be required:\n• Termite (pest) inspection\n• Land survey\n• Well testing\n• Septic certification\n• Flood search\n• Radon testing\n• Smoke detector certification\n• Certificate of occupancy\nFinancing Review",
        "page": 23
    },
    {
        "text": "Step 4: Getting Ready for Settlement\nthis type of account and then used to pay property taxes, homeowner,\nhazard, flood or mortgage insurance premiums, and other items as they\ncome due. Often several months of escrow payments are required as part\nof a property settlement or closing and should be listed on your “ Good\nFaith Estimate” (see below). Be sure to ask your lender about any escrow\npayments that you do not fully understand.\nPoints – Points are charged by lenders to recover costs or to obtain a lower\ninterest rate. One point is usually one (1) percent of your loan amount.\nThere may be some flexibility with these costs and they may be negotiable.\nSettlement or Closing costs  – One-time expenses payable at closing are\noften required for mortgages. These can include loan application fees, credit\nreport fees, appraisal fees, commitment fees, lock-in fees, inspection fees,\ntitle insurance and a survey fee. These costs are called nonrecurring closing\ncosts, and should be listed on the “ Good Faith Estimate ” provided by\nyour lender. Anticipate paying nonrecurring closing costs that are about 3\nto 4 percent of the property’s total sale price.\n22\nGood Faith Estimate\nUnder the federal Real Estate Settlement Procedures Act (RESPA), the lender\nmust deliver or mail to you a “ Good Faith Estimate ” of all of the costs and\nfees associated with your loan, and who is responsible\nto pay them, within three days of receipt of the mortgage\nloan application.  If any terms of your loan change before\nclosing day, ask for an updated “good faith estimate” so\nyou will know how much money will be required of\nyou at closing. Please remember that your good faith\nestimate is just that: an estimate. Closing costs may vary.\nBe sure to compare your estimate with actual closing\ncosts and inquire with your  lender about any differences.\nNote:\nYou may also wish to ask your lender what methods of\npayment are acceptable, as certified checks or bank cashier’s\nchecks would need to be prepared by your bank in advance\nand taken with you to the settlement/closing.",
        "page": 24
    },
    {
        "text": "You will also need to obtain homeowner’s insurance prior to closing.\nYour mortgage lender will not allow you to close the deal on your\nproperty without it. The companies you deal with for your other types\nof insurance may also be able to insure your home as well. But here\ntoo, it could pay to shop around. Visit the Department’s web site,\nwww.dobi.nj.gov, for a list of insurers that write homeowner’s policies\nin New Jersey. A paid receipt and declaration of issuance must be\npresented at settlement.\n(For more information on home insurance, see page 24.)\nStep 4: Getting Ready for Settlement\nSome tips to finalize your mortgage...\nGet a loan agreement in writing  – An agreement should describe the\ndetails of the loan and include a closing date.\nCarefully read the loan terms  – Given the prices of houses, differences\nin mortgage terms can mean thousands of dollars of savings or extra costs\nover the term of your loan. Do not sign anything you have not read or do not\nunderstand completely.\nReview your Annual Percentage Rate –You will also want to know your\nannual percentage rate (APR), which is the overall cost of credit including\nall associated costs of the loan. If your APR is .75 to 1 percentage point\nhigher than the rate you were quoted, that is a sign that significant fees are\nbeing added to the loan. Know what they are and why you are paying them.\nReview your Settlement Statement – The Settlement Statement (HUD-1)\nis prepared by the title company and itemizes all closing costs and transactions\nfor the buyer and the seller. The totals define the buyer’s net payment due at\nclosing and the seller’s net proceeds. Ask your real estate professional,\nattorney or lender to request a copy and review it with you.\n23\nSome mortgage companies will supply an insurance policy\ncalled “ forced coverage ” if a standard policy is not\nmaintained. These policies are very expensive and protect\nonly the interest of the mortgage company on the structure\nitself. It does not protect you or your belongings.\n Note:\nDon’t Forget Homeowner’s Insurance",
        "page": 25
    },
    {
        "text": "Imagine if everything inside your home (clothes,\nfurniture, appliances, children’s toys, CDs, DVDs,\netc.) suddenly vanished. How much do you think it\nwould cost to replace those things if they were\ndestroyed in a fire? What if a thief took just one valuable\npossession, like a laptop computer or stereo?  If your\nhome is not protected by insurance, where will you\nget the money to replace its contents – or a whole\nnew home – if disaster strikes?\nYou are also at risk of being asked for money, or even sued, by someone\nclaiming to have been physically or financially hurt by something you own, or\nsomething you’ve done. A stranger who falls on your front steps may blame\nyou, claiming that you ignored a loose brick or a dangerous crack in the cement.\nYour next-door neighbor may demand money if your sewer pipe breaks, pouring\nwaste water into his garden or home.\nEven if you think you already have adequate insurance coverage for all these\nmisfortunes, chances are you have no coverage at all for some other kinds of\ndisasters. For example, did you know that ordinary home insurance\npolicies won’t pay for anything that is damaged or destroyed in a flood?\nBefore buying a homeowner’s insurance policy, it is important to:\n• Understand the way homeowner’s insurance works.\n• Identify the kind of policy and coverage you really need.\n• Avoid paying for coverage you don’t need.\n• Compare policies from different companies to find the best values.\n• Protect yourself from improper sales practices.\nBefore contacting an insurer:\nThere are a few things you should know about how insurance companies work\nbefore you begin contacting companies.  For the most part, insurance is sold\neither directly by a company or through an agent or broker. A company that\ndeals directly with its policyholders is referred to as a direct writer. Agents and\nbrokers are referred to collectively as insurance producers and may represent\nonly one company or several.\n24\nStep 5: Insuring Your Home\nHome Insurance Basics",
        "page": 26
    },
    {
        "text": "25\nStep 5: Insuring Your Home\nWhen you first talk to an agent or company, you should be prepared to discuss\nyour insurance needs and answer questions about your home or property. Have\npertinent information, such as the size, age, and construction type of\nyour home ready beforehand. You should also prepare a list of any questions\nyou wish to ask.\nA homeowner’s insurance policy is a legal contract. It is written so that your\nrights and responsibilities (as well as those of the insurance company) are\nclearly stated. When you purchase homeowner’s insurance, you will receive a\npolicy contract. Read the policy carefully, and make sure that you\nunderstand it . If you have any questions, contact your agent or insurance\ncompany for clarification. Keep your policy in a safe place and know the name\nof your insurance company in addition to your agent or broker.\nNew Jersey law provides that any person who includes any\nfalse or misleading information on an application for an insurance\npolicy or on a claim is subject to criminal and civil penalties.\nNote:\nIn New Jersey, consumers who are unsuccessful in obtaining\ncoverage through a standard company may apply to the New\nJersey Insurance Underwriting Association, known as the FAIR\nPlan. When a property is rejected by a standard company, the\nowner is advised of the FAIR Plan. A property owner may apply to\nthe FAIR Plan directly or through any licensed agent. The plan insures\nhomes, mobile homes, rental units, most commercial buildings and\nbusiness property. The FAIR Plan provides basic property coverage,\nbut does not provide theft or personal liability coverage. Consider\nthe FAIR Plan only if you cannot obtain insurance from any other\nsource.\nFor more information about the FAIR Plan, contact:\nNew Jersey Insurance Underwriting Association\n744 Broad Street, PO Box 32609\nNewark, NJ 07102\n(973) 622-3838    www.njiua.org\nThe FAIR Plan",
        "page": 27
    },
    {
        "text": "There are four types of coverage contained in the homeowner policy package:\nDwelling and Personal Property Damage Coverage – Property damage\ncoverage helps pay for damage to the structure of your home or other buildings\non your property, or for the loss of personal property. Covered losses can\ninclude:\n• Household furnishings\n• Clothing\n• Personal belongings\n• Detached garages or tool\nsheds\nTypical coverage for “other structures” (structures other than the home itself)\nis 10 percent of the coverage limit on your house. The personal property\ncoverage limit is typically 50 percent of the dwelling limit, but more can be\npurchased. Personal property coverage pays the actual cash value (ACV) of\nitem(s) destroyed unless replacement cost coverage  was purchased.\nActual cash value is the amount representing the current value of the item –\nas is. Replacement cost is the amount it would take to repair or rebuild your\nhome or to repair damages with materials of like kind and quality at today’s\nprices. (See page 32.)\nYour policy may also include options such as:\nOff-Premises Coverage\nThis protects your belongings when they are not on your premises, and\nreplaces lost or stolen items with items of similar age and condition. For\nexample, you may be reimbursed for the cost of replacing your suitcase\nand its contents with items of similar age and condition if lost or stolen\nwhile on vacation.  If personal items are stolen from your vehicle they are\ncovered only if there is proof of forcible entry, unless the items are\nspecifically excluded by the policy or are specifically included under the\nvehicle policy.\n26\nWhat is Covered by a Homeowner’s Insurance Policy?\nStep 5: Insuring Your Home\n",
        "page": 28
    },
    {
        "text": "27\nStep 5: Insuring Your Home\nPersonal Property Floater or Endorsement – Your homeowner’s\ninsurance policy may provide only limited coverage for single items\nof high value, such as furs, jewelry, silver, electronics, musical\ninstruments, and other valuables.  It may be necessary to\ninsure these valuables with a special addition to your policy,\nknown as a personal property floater  or personal\nproperty endorsement .\nMiscellaneous – Your homeowner’s policy does not cover your car, your\npets or any damage your pets do to your possessions. However, your liability\ncoverage will cover damage or injury that your pet causes to others or to\ntheir possessions.\nPersonal Liability Coverage – Personal Liability Coverage protects you against\nclaims and lawsuits that result from damages or accidents occurring on or off\nyour property.\nIf a family member or pet causes injury or property damage to others, the\npersonal liability coverage pays for the cost of defending you, and for any\ndamages for which you might be liable, up to the limit of liability stated in the\npolicy.\nMedical Payments to Others Coverage – Medical payments coverage pays\nonly for medical services to someone outside your household if they are injured\nat your home regardless of fault. In some circumstances, this coverage will\nalso pay if you cause the injury of another person away from your home.\nMedical payments coverage limits are generally $1,000 for each person. Higher\nlimits are available for additional cost.\nAdditional Living Expenses – If a covered loss or peril (see page 29), such\nas a fire, forces you to live elsewhere temporarily this coverage may reimburse\nyou for living costs beyond your normal expenses, such as the reasonable cost\nof a local hotel/motel or apartment complex, or additional food or laundry\nexpenses.",
        "page": 29
    },
    {
        "text": "All homeowner’s policies include a list of exclusions, or things the policy will\nnot cover. It is important to read and be familiar with the exclusions itemized in\nyour policy.\nALL homeowner’s policies exclude\nwater damage caused by FLOOD.\nFlooding can include surface water,\noverflow of a body of water, or spray\nfrom any of these, whether or not driven\nby wind. The National Flood\nInsurance Program (NFIP)  provides\nflood coverage to residents of\ndesignated communities that comply with the federal guidelines for flood\nprevention.  ( See page 29.)\nMost homeowner’s policies also do NOT provide coverage for:\n• Normal wear and tear of personal property.\n• Loss of animals, birds or fish.\n• Damage to automobiles.\n• Water damage due to sewer or drain back-ups – These losses are\nnormally not covered by a homeowner’s or flood insurance policy\n(see above). This coverage may be available separately as an additional\nendorsement (an amendment to a policy), but may not be offered\nwhen buying homeowner’s insurance unless you ask for it.\n• Damages resulting from war, nuclear hazard, neglect, earth movement,\nor power failure.\n• Additional cost of repairs due to changes in building codes or local\nlaws enacted since the home was built. Separate coverage may be\navailable as an added endorsement.\n• Watercraft – If you own a boat, you should ask your agent or insurer\nif it is covered. Some policies will cover small motorboats and sailboats,\nbut not larger ones.\n28\nStep 5: Insuring Your Home\nCommon Exclusions",
        "page": 30
    },
    {
        "text": "29\nStep 5: Insuring Your Home\nWhat is, as well as what is not,\ncovered by your homeowner’s\npolicy will vary from insurer\nto insurer. Coverage for some\nspecific exclusions may be\nobtainable from your company.\nTalk to your agent or insurance\ncompany about your concerns\nand ask what is available.\nTypes of Policies\nThere are several types of homeowner’s policies available in New Jersey. They\nvary according to the coverage in the policy and the type of dwelling\nbeing insured.\nHO-1 Policy\nAn HO-1 policy, although available in New Jersey, is not popular. Coverage is\nlimited and resembles a dwelling policy (see page 30).\nBroad Form (HO-2)\nThe broad form (usually called HO-2) covers only those perils as itemized in\nyour policy. A peril is the cause of a possible loss; a covered peril is a peril\nfor which the policy provides coverage.\nCovered perils may include:\n• Fire or lightning\n• Windstorm or hail\n• Theft\n• Glass breakage\n• Smoke\nCheck with your insurer for the specific perils covered by your policy.\nSpecial Form (HO-3)\nThe special form (HO-3) provides comprehensive coverage for “all risks” except\nfor certain specified perils, such as earthquake or flood. It is the most popular\npolicy sold today.\nThe National Flood Insurance\nProgram  provides coverage to\nresidents of designated communities.\nTelephone: 1-888- 379-9531\nE-mail: FloodSmart@dhs.gov\nWeb site: www.floodsmar t.g ov\nFlood Insurance",
        "page": 31
    },
    {
        "text": "Renter’s Insurance (HO-4)\nIf you rent an apartment or a house, the owner of the property is responsible\nonly for insuring the building and for obtaining his or her own liability coverage.\nTherefore, you would be responsible for obtaining coverage for your personal\npossessions and your personal liability. The tenants form (H0-4), or renter’s\npolicy, insures your household contents and personal belongings against the\nperils included in the HO-2 policy. Like homeowner’s insurance, it provides\ncoverage for additional living expenses, medical payments coverage, and includes\npersonal liability protection.\nCondominiums – Unit Owner (HO-6)\nIf you own a condominium, you may have the protection of two separate\ninsurance policies – one purchased by the condominium association and one\nyou purchase yourself.\nThe association master policy covers the building, including any common walls\nand grounds, and includes personal liability protection associated with common\nproperties. You have the right to examine the association policy.\nTo protect the contents and the interior walls of your unit, you may purchase a\nunit-owner form (HO-6). An individual unit-owner policy is similar to the renter’s\ninsurance policy. The HO-6 provides coverage for a condo owner who wishes\nto insure his property or to cover any items not covered by the association’s\npolicy, such as personal property, wall, floor and ceiling coverings and any\n30\nDwelling Policy\nThe dwelling policy provides property coverage only (protection for individuals\nand families against loss to a dwelling or personal belongings). Dwelling policies\nmay be used to insure homes that do not qualify for homeowner’s insurance.\nFor example, they are commonly used to insure seasonal homes that are\nunoccupied for portions of the year. To qualify for dwelling insurance, a building\ndoes not have to be occupied by the owner, and it may even be under construction.\nStep 5: Insuring Your Home\nYou will also see the term “dwelling” appear in a\nhomeowner’s policy. In this context, “dwelling” means the\nstructure in which the homeowner lives.\nNote:",
        "page": 32
    },
    {
        "text": "31\nStep 5: Insuring Your Home\naccessories not originally installed in the unit. It also provides personal liability\nprotection.\nThe Condominium HO-6 policy also provides Loss Assessment Coverage ,\nwhich will pay the unit-owner’s share of any assessment charged to all unit\nowners by the condominium association when the assessment is a direct result\nof a physical loss or damage to the common property which is not covered by\nthe association’s insurance policy.\nThe standard unit owner’s policy automatically provides a limit of $1,000 for\neach assessment relating to the residence’s premises; however, higher limits of\ncoverage may be purchased. It should be noted that major assessments for\nlarge complexes can be as much as $50,000 per unit owner; therefore unit\nowners may wish to consider a higher coverage option.\nEvery insurance company has\nunderwriting guidelines. Underwriting\nguidelines are the factors the company\nuses to determine which risks it will\naccept and which it will decline or refuse.\nUnder current law, insurance companies\nhave the ability to set their own\nunderwriting guidelines and determine\nwhat “risk factors ” are important to them. Therefore, owners of properties\nwith older wiring or plumbing, a swimming pool, an underground heating oil\nstorage tank, or a history of claims may need to contact a number of companies\nto obtain the coverage they want. Insurers may also ask that property owners\nwith these “risk factors” carry a higher deductible before writing a new policy.\nIn addition, applications for property insurance may ask for personal information,\nsuch as the type of job you have, where you work, your leisure activities and\ndetails of any recent claims you may have had.\nThe New Jersey Department of Banking and Insurance does require that company\nunderwriting guidelines not be arbitrary, capricious or unfairly discriminatory\nand must be applied consistently throughout the state.\nUnderwriting Guidelines",
        "page": 33
    },
    {
        "text": "Location, location, location…\nWhere your home is located can affect the cost of your coverage. Are you in an\nurban, suburban or rural neighborhood? Are you near a body of water, such as\nthe ocean, a river, or large stream? All of these factors can influence your\npremium, or what you pay for homeowner’s coverage.\nBefore buying homeowner’s insurance, it is important to consider the\namount of coverage you need to have on your house and its contents.\nYou need to think about:\n• The kind of coverage you want and what you are willing to pay.\n• The value of your home and its contents.\n• Whether or not you want full coverage or are willing to share the cost of a\nloss with your insurer.\nYou will need to choose limits for the coverage you purchase. A limit is the\nmaximum dollar amount the insurer will pay overall or under a particular\ncoverage. In addition, you will also need to choose deductibles. In the event\nof a covered peril , a deductible is the amount of the loss which you (the\ninsured) are responsible for paying before the insurance company pays. Choosing\nhigher deductibles may decrease your premium.\nActual Cash Value and Replacement Cost\nBefore buying a policy, it is important to understand the difference between\nreplacement cost  and actual cash value . Typically, homeowner policies\nprovide replacement cost coverage on the home and actual cash value\non personal property.\nActual cash value  is an amount representing the current value of the\nitem, as is. Replacement cost is the amount it would take to repair, replace\nor rebuild your home with materials of like kind and quality at today’s prices.\n32\nStep 5: Insuring Your Home\nBuying the Right Amount of Coverage\nRemember: The more perils your policy covers, the more you\nwill pay for it.",
        "page": 34
    },
    {
        "text": "Market value is a real estate term that describes the current value of your\nhome if you were to sell it, including the price of the land, at a given point in\ntime.  The value of the land your home sits on is not generally considered when\ndetermining amounts of insurance.\nThe mortgage value is the amount of money owed to the mortgage lender.\nMortgage lenders generally require that the home be insured for at least the\namount of the outstanding mortgage to protect the lender’s interest. As a result,\nthe market value or mortgage value of your home may vary greatly from the\nreplacement cost. Discuss this matter with your insurance agent or representative.\nWhether your home is insured for replacement value or actual cash value, it is\nimportant to keep track of the home’s value. A room addition, new insulation,\nand yearly inflation all increase the replacement cost of your home while the\nactual cash value may decrease over time. Check with your agent or insurance\ncompany at least once a year to be sure that your policy continues to provide\nadequate coverage.\nSpecial Deductibles\nIn addition to the standard deductibles in a homeowner’s policy, there are also\nseparate deductibles that you may encounter.\nWind loss deductibles – This is a separate deductible from the standard\nhomeowner’s policy deductible that applies to all other perils.\nHurricane deductibles – Some insurers have begun including hurricane\ndeductibles in homeowner’s policies, which are higher than the standard\nhomeowner’s policy deductible. These deductibles apply only to losses\nfrom storms designated as hurricanes by the National Weather Service.\n33\nStep 5: Insuring Your Home\nIn order to qualify for replacement cost coverage, you generally must insure\nthe dwelling to at least 80 percent of the replacement cost. Underinsuring your\nproperty may cause reductions in future loss payments.\nNote It is also important not to confuse replacement cost  with\nmarket value, or mortgage value .",
        "page": 35
    },
    {
        "text": "34\nStep 5: Insuring Your Home\nOptional coverage that may be available from some companies\n• Credit Card Forgery and Depositors Forgery Coverage Endorsement\n• Identity Theft\n• Personal Recreational Vehicles\n• Secondary Residence Premises Endorsement\nCompare Premiums\nComparison shopping for homeowner’s insurance can be worth the effort. Be\na wise consumer and shop around for the product that is best for you. Insurance\ncompanies vary greatly in the price of their policies and in the level of service\nthey provide to consumers. For rate comparison information, visit the\nDepartment’s web site, www.dobi.nj.gov.\nTerminations, Denials and Cancellations\nNew Policies – When a policy first takes effect, the insurer has a right to\ncancel that policy any time within the first 60 days  for any reason not\notherwise prohibited by law. The cancellation is not effective until at least\n10 days after the insurance company mails or delivers to you a written\nnotice of cancellation.\nRenewal on Altered Terms – Sometimes an insurer will renew a policy,\nbut will raise the rates or make the terms less favorable. An insurer is not\nallowed to change the terms of coverage unless it gives written notice of\nthe changes to the insured, along with the renewal offer. To be effective,\nthe notice must be mailed no less than 30 days before the renewal date.\nNon-renewal – Non-renewal of a policy refers to the termination of a\npolicy at its expiration date. If the insurance company decides that it does\nnot want to renew your policy, it must mail or deliver to you a written\nnotice at least 30 days before the expiration date. The non-renewal or\ncancellation notice must include the specific reason for the non-renewal or\ncancellation as well as the facts that make that reason applicable to your\npolicy. Refer to your insurance policy for a list of the reasons your company\nmay non-renew your policy.\nTermination for Non-Payment of Premium – Any insurance company\nwill terminate coverage if the premium is not paid on time. There is no\ngrace period for premium payments for homeowner’s insurance. Always\nbe sure to pay your premiums promptly.",
        "page": 36
    },
    {
        "text": "If you have followed Steps 1 through 5,\nyou have now succeeded in deciding what\ntype of home is right for you, finding and\ncontracting for a property, securing your\nfinancing and obtaining insurance\nprotection. Now you are ready to seal the\ndeal and open the door of what will soon\nbe your new home.\nSettlement Statement\nAs you draw near to your closing date, it\nis recommended that you review a copy\nof your Settlement Statement (HUD-1).\nAsk your real estate professional, attorney or lender to request this document\nfrom the title company and review it with you. The HUD-1 provides the total\namount of cash you’ll need at closing and details how those funds will be\ndisbursed. The HUD-1 must be given to the buyer at, if not before, closing.\nStep 6: Sealing the Deal\n35\nFinal Walk-Through\nA final walk-through of the house should be done on the day prior to settlement/\nclosing. This final inspection gives you the opportunity to be sure the seller has\nmoved out and completed any repairs agreed upon in the sales contract or as a\nresult of a home inspection report. During the walk-through, make sure that all\nsystems (for example, heating and cooling) are working properly and any\nappliances or other items the seller agreed to leave behind are in the house and\nin good working order.\nClosing\nIn New Jersey, most settlements, or closings, are done in a face-to-face meeting\nof the buyer, the seller, the real estate agents, the lawyers, the title clerk and the\nrepresentative from the mortgage company.  The closing can take place at the\noffice of the attorney, real estate agent or title insurance company. At this time,\nRemember:\nVerify acceptable methods of payment with your\nlender – in most cases you will need to have a certified\ncheck or bank cashier’s check made out in advance to\nbring with you to the settlement/closing.",
        "page": 37
    },
    {
        "text": "Step 6: Sealing the Deal\nAfter all the papers are reviewed, explained, signed and exchanged and the\nseller is paid, you – the buyer – will be handed the keys to your new property.\n36\nthe buyer will generally have to pay the balance of all monies owed to the seller\nand closing costs. This money could be disbursed either by your attorney or\nthe closing agent.\nIt is very important that you read and understand all documents\npresented to you at the closing before signing them. Once you\nhave signed them, it is presumed that you are in agreement with,\nand are subsequently bound by, the terms.\nRecording of the Deed and Mortgage\nThe deed and the mortgage that you received must now be recorded in order to\nestablish your clear title to the property. This is usually done by the title agent\nor your attorney. Be sure that these arrangements are made and completed as\nsoon as possible after the closing. Request that a copy be provided to you.\nMaking Your Dream a Reality\nAlthough the real estate process can be complex, purchasing your new home\ncan be a rewarding experience. As mentioned earlier, this is one of the largest\nand most important investments that you will make in your life. You are looking\nfor more than just a roof over your head. You are looking for a home, a place to\nexpress your values and lifestyle, a place to share time with family and friends,\na place to retreat at the end of the day. Remember, advanced planning and\nmaking sure you have educated yourself regarding the process of buying a\nhome can relieve a great deal of the anxiety and represent the first steps in\nachieving your dream.\nRemember:\nDon’t forget to ask for keys to the mailbox and shed,\nthe remotes for the garage door opener, and security\ncodes, etc., if any.\nBefore You Sign on the Dotted Line...",
        "page": 38
    },
    {
        "text": "For More Information\nHave a question related to real estate,\nmortgages, or insurance? Contact the\nDepartment’s Consumer Inquiry and\nResponse Center\nNew Jersey Department of Banking\nand Insurance - Consumer Inquiry and\nResponse Center\nP.O. Box 471\nTrenton, NJ 08625-0471\n(609) 292-7272  or 1-800-446-7467\nFile a complaint online:\nwww.dobi.nj.gov/consumer.htm\nVisit us online at\nwww.dobi.nj.gov",
        "page": 40
    }
]